probonopd/ESP8266HueEmulator/ESP8266HueEmulator/LightService.cpp
void addLightJson(aJsonObject* root, int numberOfTheLight, LightHandler *lightHandler);
void lightsIdFn(WcFnRequestHandler *whandler, String requestUri, HTTPMethod method) {
  int numberOfTheLight = atoi(whandler->getWildCard(1).c_str()) - 1;
  LightHandler *handler = LightService.getLightHandler(numberOfTheLight);
  switch (method) {
    case HTTP_GET: {
      aJsonObject *root;
      root = aJson.createObject();
      addLightJson(root, numberOfTheLight, handler);
      sendJson(root);
      break;
    }
    case HTTP_PUT:
      // XXX do something here
      sendUpdated();
      break;
    default:
      sendError(4, requestUri, "Light method not supported");
      break;
  }
}

void lightsIdStateFn(WcFnRequestHandler *whandler, String requestUri, HTTPMethod method) {
  int numberOfTheLight = max(0, atoi(whandler->getWildCard(1).c_str()) - 1);
  LightHandler *handler = LightService.getLightHandler(numberOfTheLight);
  if (!handler) {
    char buff[100] = {};
    sprintf(buff, "Requested light not available for number %d", numberOfTheLight);
    sendError(3, requestUri, buff);
    return;
  }

  switch (method) {
    case HTTP_POST:
    case HTTP_PUT: {
      Serial.print("lightsIdState:");
      Serial.println(HTTP->arg("plain"));
      aJsonObject* parsedRoot = aJson.parse(( char*) HTTP->arg("plain").c_str());
      if (!parsedRoot) {
        // unparseable json
        sendError(2, requestUri, "Bad JSON body in request");
        return;
      }
      HueLightInfo currentInfo = handler->getInfo(numberOfTheLight);
      HueLightInfo newInfo;
      if (!parseHueLightInfo(currentInfo, parsedRoot, &newInfo)) {
        aJson.deleteItem(parsedRoot);
        return;
      }
      handler->handleQuery(numberOfTheLight, newInfo, parsedRoot);
      sendJson(generateTargetPutResponse(parsedRoot, "/lights/" + whandler->getWildCard(1) + "/state/"));
      aJson.deleteItem(parsedRoot);
      break;
    }
    default:
      sendError(4, requestUri, "Light method not supported");
      break;
  }
}

void lightsNewFn(WcFnRequestHandler *handler, String requestUri, HTTPMethod method) {
  // dump empty object
  aJsonObject *lights = aJson.createObject();
  sendJson(lights);
}

void LightServiceClass::begin() {
  begin(new ESP8266WebServer(80));
}

void LightServiceClass::begin(ESP8266WebServer *svr) {
  HTTP = svr;
  macString = WiFi.macAddress();
  bridgeIDString = macString;
  bridgeIDString.replace(":", "");
  bridgeIDString = bridgeIDString.substring(0, 6) + "FFFE" + bridgeIDString.substring(6);
  ipString = StringIPaddress(WiFi.localIP());
  netmaskString = StringIPaddress(WiFi.subnetMask());
  gatewayString = StringIPaddress(WiFi.gatewayIP());

  Serial.print("Starting HTTP at ");
  Serial.print(WiFi.localIP());
  Serial.print(":");
  Serial.println(80);

  HTTP->on("/description.xml", HTTP_GET, descriptionFn);
  on(configFn, "/api/*/config", HTTP_ANY);
  on(configFn, "/api/config", HTTP_GET);
  on(wholeConfigFn, "/api/*", HTTP_GET);
  on(wholeConfigFn, "/api/", HTTP_GET);
  on(authFn, "/api", HTTP_POST);
  on(unimpFn, "/api/*/schedules", HTTP_GET);
  on(unimpFn, "/api/*/rules", HTTP_GET);
  on(unimpFn, "/api/*/sensors", HTTP_GET);
  on(scenesFn, "/api/*/scenes", HTTP_ANY);
  on(scenesIdFn, "/api/*/scenes/*", HTTP_ANY);
  on(scenesIdLightFn, "/api/*/scenes/*/lightstates/*", HTTP_ANY);
  on(scenesIdLightFn, "/api/*/scenes/*/lights/*/state", HTTP_ANY);
  on(groupsFn, "/api/*/groups", HTTP_ANY);
  on(groupsIdFn, "/api/*/groups/*", HTTP_ANY);
  on(groupsIdActionFn, "/api/*/groups/*/action", HTTP_ANY);
  on(lightsFn, "/api/*/lights", HTTP_ANY);
  on(lightsNewFn, "/api/*/lights/new", HTTP_ANY);
  on(lightsIdFn, "/api/*/lights/*", HTTP_ANY);
  on(lightsIdStateFn, "/api/*/lights/*/state", HTTP_ANY);

  HTTP->begin();

  String serial = macString;
  serial.toLowerCase();
  
  Serial.println("Starting SSDP...");
  SSDP.setSchemaURL("description.xml");
  SSDP.setHTTPPort(80);
  SSDP.setName("Philips hue clone");
  SSDP.setSerialNumber(serial.c_str());
  SSDP.setURL("index.html");
  SSDP.setModelName("IpBridge");
  SSDP.setModelNumber("0.1");
  SSDP.setModelURL("http://www.meethue.com");
  SSDP.setManufacturer("Royal Philips Electronics");
  SSDP.setManufacturerURL("http://www.philips.com");

  //SSDP.setDeviceType((char*)"upnp:rootdevice");
  SSDP.setDeviceType("urn:schemas-upnp-org:device:basic:1");
  //SSDP.setMessageFormatCallback(ssdpMsgFormatCallback);
  SSDP.begin();
  Serial.println("SSDP Started");
}

void LightServiceClass::update() {
  HTTP->handleClient();
}

void sendJson(aJsonObject *root) {
  // Take aJsonObject and print it to Serial and to WiFi
  // From https://github.com/pubnub/msp430f5529/blob/master/msp430f5529.ino
  char *msgStr = aJson.print(root);
  aJson.deleteItem(root);
  Serial.println(millis());
  Serial.println(msgStr);
  HTTP->send(200, "application/json", msgStr);
  free(msgStr);
}

// ==============================================================================================================
// Color Conversion
// ==============================================================================================================
// TODO: Consider switching to something along the lines of
// https://github.com/patdie421/mea-edomus/blob/master/src/philipshue_color.c
// and/ or https://github.com/kayno/arduinolifx/blob/master/color.h
// for color coversions instead
// ==============================================================================================================

// Based on http://stackoverflow.com/questions/22564187/rgb-to-philips-hue-hsb
// The code is based on this brilliant note: https://github.com/PhilipsHue/PhilipsHueSDK-iOS-OSX/commit/f41091cf671e13fe8c32fcced12604cd31cceaf3

rgbcolor getXYtoRGB(float x, float y, int brightness_raw) {
  float Y = brightness_raw / 250.0f;

  float z = 1.0f - x - y;
  float X = (Y / y) * x;
  float Z = (Y / y) * z;

  // sRGB D65 conversion
  // See https://en.wikipedia.org/wiki/SRGB
  float r =  X * 3.2406f - Y * 1.5372f - Z * 0.4986f;
  float g = -X * 0.9689f + Y * 1.8758f + Z * 0.0415f;
  float b =  X * 0.0557f - Y * 0.2040f + Z * 1.0570f;

  if (r > b && r > g && r > 1.0f) {
    // red is too big
    g = g / r;
    b = b / r;
    r = 1.0f;
  }
  else if (g > b && g > r && g > 1.0f) {
    // green is too big
    r = r / g;
    b = b / g;
    g = 1.0f;
  }
  else if (b > r && b > g && b > 1.0f) {
    // blue is too big
    r = r / b;
    g = g / b;
    b = 1.0f;
  }

